<?php
return [
    'validate' => [
        'required' => '不能为空',
        'numeric'  => '',
        
        'lmin'     => '长度不能小于{0}',
        'lmax'     => '长度不能超过{0}',
        'len'      => '长度不在{0}到{1}之间',

        'in'       => '不在选择范围内',
        'between'  => '不在{0}到{1}之间',

        'char'     => '只能包含英文字母',
        'code'     => '只能包含英文字母和数字',
        'url'      => '无效的超链接地址',
        'email'    => '无效的邮箱地址',
        'phone'    => '无效的手机号',
        'zip'      => '无效的邮编',
        'qq'       => '无效的QQ号码',
        'number'   => '',
        
    ],
];